In [ ]:
import pandas as pd
import numpy as np

from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, MinMaxScaler

In [ ]:
train = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Titanic/train.csv')
test = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Titanic/test.csv')
submission = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/Titanic/gender_submission.csv')

In [ ]:
test.head()

   PassengerId  Pclass  ... Cabin Embarked
0          892       3  ...   NaN        Q
1          893       3  ...   NaN        S
2          894       2  ...   NaN        Q
3          895       3  ...   NaN        S
4          896       3  ...   NaN        S

[5 rows x 11 columns]

In [ ]:
train.set_index('PassengerId', inplace=True)
test.set_index('PassengerId', inplace=True)

In [ ]:
all_data = pd.concat([train, test], sort=False)
all_data_index = all_data.index

In [ ]:
na_check = all_data.isna().sum() / len(all_data)
na_check = na_check[na_check > 0]
na_check

Survived    0.319328
Age         0.200917
Fare        0.000764
Cabin       0.774637
Embarked    0.001528
dtype: float64

In [ ]:
all_data = all_data.drop(['Cabin'], axis=1)
all_data = all_data.drop(['Ticket'], axis=1)

In [ ]:
all_data.head()

             Survived  Pclass  ...     Fare Embarked
PassengerId                    ...
1                 0.0       3  ...   7.2500        S
2                 1.0       1  ...  71.2833        C
3                 1.0       3  ...   7.9250        S
4                 1.0       1  ...  53.1000        S
5                 0.0       3  ...   8.0500        S

[5 rows x 9 columns]

In [ ]:
col = all_data.columns

for i in col:
  nq = all_data[i].unique()

  print(i)
  print(nq)

Survived
[ 0.  1. nan]
Pclass
[3 1 2]
Name
['Braund, Mr. Owen Harris'
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)'
 'Heikkinen, Miss. Laina' ... 'Saether, Mr. Simon Sivertsen'
 'Ware, Mr. Frederick' 'Peter, Master. Michael J']
Sex
['male' 'female']
Age
[22.   38.   26.   35.     nan 54.    2.   27.   14.    4.   58.   20.
 39.   55.   31.   34.   15.   28.    8.   19.   40.   66.   42.   21.
 18.    3.    7.   49.   29.   65.   28.5   5.   11.   45.   17.   32.
 16.   25.    0.83 30.   33.   23.   24.   46.   59.   71.   37.   47.
 14.5  70.5  32.5  12.    9.   36.5  51.   55.5  40.5  44.    1.   61.
 56.   50.   36.   45.5  20.5  62.   41.   52.   63.   23.5   0.92 43.
 60.   10.   64.   13.   48.    0.75 53.   57.   80.   70.   24.5   6.
  0.67 30.5   0.42 34.5  74.   22.5  18.5  67.   76.   26.5  60.5  11.5
  0.33  0.17 38.5 ]
SibSp
[1 0 3 4 2 5 8]
Parch
[0 1 2 5 3 4 6 9]
Fare
[  7.25    71.2833   7.925   53.1      8.05     8.4583  51.8625  21.075
  11.1333  30.0708  16.7     26.55    31.275    7.8542  16.      29.125
  13.      18.       7.225   26.       8.0292  35.5     31.3875 263.
   7.8792   7.8958  27.7208 146.5208   7.75    10.5     82.1708  52.
   7.2292  11.2417   9.475   21.      41.5792  15.5     21.6792  17.8
  39.6875   7.8     76.7292  61.9792  27.75    46.9     80.      83.475
  27.9     15.2458   8.1583   8.6625  73.5     14.4542  56.4958   7.65
  29.      12.475    9.       9.5      7.7875  47.1     15.85    34.375
  61.175   20.575   34.6542  63.3583  23.      77.2875   8.6542   7.775
  24.15     9.825   14.4583 247.5208   7.1417  22.3583   6.975    7.05
  14.5     15.0458  26.2833   9.2167  79.2      6.75    11.5     36.75
   7.7958  12.525   66.6      7.3125  61.3792   7.7333  69.55    16.1
  15.75    20.525   55.      25.925   33.5     30.6958  25.4667  28.7125
   0.      15.05    39.      22.025   50.       8.4042   6.4958  10.4625
  18.7875  31.     113.275   27.      76.2917  90.       9.35    13.5
   7.55    26.25    12.275    7.125   52.5542  20.2125  86.5    512.3292
  79.65   153.4625 135.6333  19.5     29.7     77.9583  20.25    78.85
  91.0792  12.875    8.85   151.55    30.5     23.25    12.35   110.8833
 108.9     24.      56.9292  83.1583 262.375   14.     164.8667 134.5
   6.2375  57.9792  28.5    133.65    15.9      9.225   35.      75.25
  69.3     55.4417 211.5      4.0125 227.525   15.7417   7.7292  12.
 120.      12.65    18.75     6.8583  32.5      7.875   14.4     55.9
   8.1125  81.8583  19.2583  19.9667  89.1042  38.5      7.725   13.7917
   9.8375   7.0458   7.5208  12.2875   9.5875  49.5042  78.2667  15.1
   7.6292  22.525   26.2875  59.4      7.4958  34.0208  93.5    221.7792
 106.425   49.5     71.      13.8625   7.8292  39.6     17.4     51.4792
  26.3875  30.      40.125    8.7125  15.      33.      42.4     15.55
  65.      32.3208   7.0542   8.4333  25.5875   9.8417   8.1375  10.1708
 211.3375  57.      13.4167   7.7417   9.4833   7.7375   8.3625  23.45
  25.9292   8.6833   8.5167   7.8875  37.0042   6.45     6.95     8.3
   6.4375  39.4     14.1083  13.8583  50.4958   5.       9.8458  10.5167
   7.       9.6875  82.2667   3.1708  31.6833  31.5     57.75     7.85
  60.      15.0333  15.5792  28.5375  25.7     10.7083  13.9      7.8208
   7.7792  31.6792   7.2833  75.2417      nan  12.1833  13.775    8.9625
  25.7417  42.5     27.4458 136.7792   9.325   12.7375  45.5      7.575
   7.5792   7.7208]
Embarked
['S' 'C' 'Q' nan]

In [ ]:
title = ['Mr.', 'Miss.', 'Mrs.', 'Master.', 'Dr.', 'Ms.', 'Col.', 'Capt.', 'Rev.', 'Major']

all_data['Name_None'] = False
for i in title:
  all_data['Name_'+i] = False

for idx, row in all_data.iterrows():
  name = row['Name']
  name_ = 'None'
  name = name.replace('Mr ', 'Mr.')
  name = name.replace('Mrs ', 'Mrs.')

  for tt in title:
    if name.find(tt) != -1:
      name_ = tt
 
  all_data['Name_'+name_][idx] = True

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
all_data = all_data.drop(['Name'], axis=1)

In [ ]:
data_object = all_data.select_dtypes(include=object)
data_non_object = all_data.select_dtypes(exclude=object)

In [ ]:
imputer = SimpleImputer(strategy='mean')
imputer.fit(data_non_object)
data_non_object_ = imputer.transform(data_non_object)
data_non_object_ = pd.DataFrame(data_non_object_, columns=data_non_object.columns, index=all_data_index)
data_non_object_

             Survived  Pclass        Age  ...  Name_Capt.  Name_Rev.  Name_Major
PassengerId                               ...
1            0.000000     3.0  22.000000  ...         0.0        0.0         0.0
2            1.000000     1.0  38.000000  ...         0.0        0.0         0.0
3            1.000000     3.0  26.000000  ...         0.0        0.0         0.0
4            1.000000     1.0  35.000000  ...         0.0        0.0         0.0
5            0.000000     3.0  35.000000  ...         0.0        0.0         0.0
...               ...     ...        ...  ...         ...        ...         ...
1305         0.383838     3.0  29.881138  ...         0.0        0.0         0.0
1306         0.383838     1.0  39.000000  ...         0.0        0.0         0.0
1307         0.383838     3.0  38.500000  ...         0.0        0.0         0.0
1308         0.383838     3.0  29.881138  ...         0.0        0.0         0.0
1309         0.383838     3.0  29.881138  ...         0.0        0.0         0.0

[1309 rows x 17 columns]

In [ ]:
all_data = pd.merge(data_object, data_non_object_, left_index=True, right_index=True)

In [ ]:
all_data.head()

                Sex Embarked  Survived  ...  Name_Capt.  Name_Rev.  Name_Major
PassengerId                             ...
1              male        S       0.0  ...         0.0        0.0         0.0
2            female        C       1.0  ...         0.0        0.0         0.0
3            female        S       1.0  ...         0.0        0.0         0.0
4            female        S       1.0  ...         0.0        0.0         0.0
5              male        S       0.0  ...         0.0        0.0         0.0

[5 rows x 19 columns]

In [ ]:
all_data['Sex(status)'] = all_data['Sex'] == 'male'
all_data = all_data.drop(['Sex'], axis=1)

In [ ]:
all_data['Embarked(S)'] = (all_data['Embarked'] == 'S') | (all_data['Embarked'].isna())
all_data['Embarked(C)'] = all_data['Embarked'] == 'C'
all_data['Embarked(Q)'] = all_data['Embarked'] == 'Q'
all_data = all_data.drop(['Embarked'], axis=1)

In [ ]:
all_data['Family_members'] = 0
all_data['Family_members'] = 1 + all_data['SibSp'] + all_data['Parch']

In [ ]:
all_data.head()

             Survived  Pclass   Age  ...  Embarked(C)  Embarked(Q)  Family_members
PassengerId                          ...
1                 0.0     3.0  22.0  ...        False        False             2.0
2                 1.0     1.0  38.0  ...         True        False             2.0
3                 1.0     3.0  26.0  ...        False        False             1.0
4                 1.0     1.0  35.0  ...        False        False             2.0
5                 0.0     3.0  35.0  ...        False        False             1.0

[5 rows x 23 columns]

In [ ]:
nTrain = len(train)
train = all_data[:nTrain]
test = all_data[nTrain:]

In [ ]:
cormat = train.corr()
cormat = cormat.index[abs(cormat['Survived']) > 0.1]
cormat

Index(['Survived', 'Pclass', 'Fare', 'Name_Mr.', 'Name_Miss.', 'Name_Mrs.',
       'Sex(status)', 'Embarked(S)', 'Embarked(C)'],
      dtype='object')

In [ ]:
train.describe()

         Survived      Pclass  ...  Name_Major  Family_members
count  891.000000  891.000000  ...  891.000000      891.000000
mean     0.383838    2.308642  ...    0.002245        1.904602
std      0.486592    0.836071  ...    0.047351        1.613459
min      0.000000    1.000000  ...    0.000000        1.000000
25%      0.000000    2.000000  ...    0.000000        1.000000
50%      0.000000    3.000000  ...    0.000000        1.000000
75%      1.000000    3.000000  ...    0.000000        2.000000
max      1.000000    3.000000  ...    1.000000       11.000000

[8 rows x 18 columns]

In [ ]:
from sklearn.model_selection import train_test_split

train_x = train.drop(['Survived'], axis=1)
train_y = train['Survived']

train_x, val_x, train_y, val_y = train_test_split(train_x, train_y, test_size=0.2, shuffle=True)

test_id_idx = test.index

test_x = test.drop(['Survived'], axis=1)

In [ ]:
from xgboost import XGBRegressor

xgb = XGBRegressor(randome_state = 37)
xgb.fit(train_x, train_y)

[07:16:10] WARNING: /workspace/src/objective/regression_obj.cu:152: reg:linear is now deprecated in favor of reg:squarederror.

XGBRegressor(base_score=0.5, booster='gbtree', colsample_bylevel=1,
             colsample_bynode=1, colsample_bytree=1, gamma=0,
             importance_type='gain', learning_rate=0.1, max_delta_step=0,
             max_depth=3, min_child_weight=1, missing=None, n_estimators=100,
             n_jobs=1, nthread=None, objective='reg:linear', random_state=0,
             randome_state=37, reg_alpha=0, reg_lambda=1, scale_pos_weight=1,
             seed=None, silent=None, subsample=1, verbosity=1)

In [ ]:
from sklearn.metrics import mean_squared_error, mean_absolute_error
pred_train = xgb.predict(train_x)
pred_val = xgb.predict(val_x)

print('train mae score: ', mean_absolute_error(train_y, pred_train))
print('val mae score:', mean_absolute_error(val_y, pred_val))

train mae score:  0.21807109819871656
val mae score: 0.22929467868538542

In [ ]:
pred = grid_search.predict(test_x)
submission['Survived'] = pred

In [ ]:
submission['Survived'] = round(submission['Survived'])
submission

     PassengerId  Survived
0            892       0.0
1            893       0.0
2            894       0.0
3            895       0.0
4            896       1.0
..           ...       ...
413         1305       0.0
414         1306       1.0
415         1307       0.0
416         1308       0.0
417         1309       1.0

[418 rows x 2 columns]

In [ ]:
submission.to_csv('/content/drive/MyDrive/Colab Notebooks/Titanic/submission.csv', index=False)